---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DWFImportOptions Constructor
DWFImportOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | DWFImportOptions(DWFImportOptions) | Constructs a new instance of DWFImportOptions as a copy of the import options. |
|  | DWFImportOptions(IList<(Of <<'(ElementId>)>>)) | Constructs a new instance of DWFImportOptions with an array of imported sheet views. |

# See Also

DWFImportOptions Class

DWFImportOptions Members

Autodesk.Revit.DB Namespace